In [1]:
import numpy as np
import pandas as pd

In [3]:
labels=['a','b','c']
my_list=[1,2,3]
arr=np.array([1,2,3])
d={'a':1,'b':2,'c':3}

In [4]:
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    1
b    2
c    3
dtype: int64

In [7]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [8]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
ser1=pd.Series([1,2,3,4],['bhavana','niki','anil','krupa'])
ser1

bhavana    1
niki       2
anil       3
krupa      4
dtype: int64

In [14]:
ser1['anil']

3

In [16]:
ser1+ser1

bhavana    2
niki       4
anil       6
krupa      8
dtype: int64

In [17]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [18]:
np.random.seed(101)

In [21]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [29]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [31]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [32]:
df['new']=df['W']+df['X']

In [33]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [34]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [37]:
df.drop('new',axis=1,inplace=True)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [41]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
df.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [44]:
df.loc['B','Y']

-0.8480769834036315

In [45]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
df<0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [49]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [53]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [54]:
df[(df['W']>0)&(df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [57]:
newind='CA NY WY OR CO'.split()

In [58]:

df['states']=newind
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [61]:
newind='BA HD NM JI CO'.split()
df['disticts']=newind
df

          W         X         Y         Z states disticts
A  2.706850  0.628133  0.907969  0.503826     CA       BA
B  0.651118 -0.319318 -0.848077  0.605965     NY       HD
C -2.018168  0.740122  0.528813 -0.589001     WY       NM
D  0.188695 -0.758872 -0.933237  0.955057     OR       JI
E  0.190794  1.978757  2.605967  0.683509     CO       CO

In [62]:
df.set_index('states')

               W         X         Y         Z disticts
states
CA      2.706850  0.628133  0.907969  0.503826       BA
NY      0.651118 -0.319318 -0.848077  0.605965       HD
WY     -2.018168  0.740122  0.528813 -0.589001       NM
OR      0.188695 -0.758872 -0.933237  0.955057       JI
CO      0.190794  1.978757  2.605967  0.683509       CO

In [64]:
df.set_index('disticts')

                 W         X         Y         Z states
disticts
BA        2.706850  0.628133  0.907969  0.503826     CA
HD        0.651118 -0.319318 -0.848077  0.605965     NY
NM       -2.018168  0.740122  0.528813 -0.589001     WY
JI        0.188695 -0.758872 -0.933237  0.955057     OR
CO        0.190794  1.978757  2.605967  0.683509     CO

In [65]:
df.set_index('states',inplace=True)

In [66]:
df

               W         X         Y         Z disticts
states
CA      2.706850  0.628133  0.907969  0.503826       BA
NY      0.651118 -0.319318 -0.848077  0.605965       HD
WY     -2.018168  0.740122  0.528813 -0.589001       NM
OR      0.188695 -0.758872 -0.933237  0.955057       JI
CO      0.190794  1.978757  2.605967  0.683509       CO